Tekla Open API Reference for Tekla Structures 2025
LineTypes.Equals Method
 Returns true if the current object and the given object are equal.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
Parameters
obj
Type: System.Object
The object we wish to check the equality with.
Return Value
Type: Boolean
True if the given object equals the current object.
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace